Repository: point85/OEE-Mobile
Catalog: oee_mobile/lib/l10n/app_*.arb
Languages: de, es, zh

# appName
source: Point85 OEE Application
de: Point85 OEE Anwendung
es: Aplicación OEE Point85
zh: Point85 OEE 应用程序

# homeAboutText
source: The Point85 Overall Equipment Effectiveness (OEE) applications enable collection of equipment data from multiple sources to support OEE calculations of performance, availability and quality. For more information please visit https://github.com/Point85/OEE-Designer.
de: Die Point85 Gesamtanlageneffektivität (OEE) Anwendungen ermöglichen die Sammlung von Anlagendaten aus mehreren Quellen zur Unterstützung von OEE-Berechnungen für Leistung, Verfügbarkeit und Qualität. Für weitere Informationen besuchen Sie bitte https://github.com/Point85/OEE-Designer.
es: Las aplicaciones de Eficiencia General de Equipos (OEE) de Point85 permiten la recopilación de datos de equipos de múltiples fuentes para apoyar los cálculos de OEE de rendimiento, disponibilidad y calidad. Para más información, visite https://github.com/Point85/OEE-Designer.
zh: Point85 设备综合效率（OEE）应用程序能够从多个数据源收集设备数据，以支持性能、可用性和质量的 OEE 计算。 更多信息请访问 https://github.com/Point85/OEE-Designer。

# homeSettings
source: Settings
de: Einstellungen
es: Configuraciones
zh: 设置

# homeRefresh
source: Refresh
de: Aktualisieren
es: Actualizar
zh: 刷新

# homeAbout
source: About
de: Über
es: Acerca de
zh: 关于

# homeSave
source: Save
de: Speichern
es: Guardar
zh: 保存

# homeEquipStatus
source: Requesting equipment status ...
de: Anlagenstatus wird angefordert ...
es: Solicitando estado del equipo ...
zh: 正在请求设备状态...

# homeSettingsSaved
source: Settings saved.
de: Einstellungen gespeichert.
es: Configuraciones guardadas.
zh: 设置已保存。

# homeServerHint
source: HTTP server name or IP address
de: HTTP-Servername oder IP-Adresse
es: Nombre del servidor HTTP o dirección IP
zh: HTTP 服务器名称或 IP 地址

# homeServerLabel
source: Server *
es: Servidor *
zh: 服务器 *

# homePortHint
source: HTTP server port
es: Puerto del servidor HTTP
zh: HTTP 服务器端口

# homePortLabel
source: Port *
es: Puerto *
zh: 端口 *

# equipment
source: Equipment : {name}
de: Anlage : {name}
es: Equipo : {name}
zh: 设备：{name}

# equip
source: Equipment
de: Anlage
es: Equipo
zh: 设备

# equipAvailStart
source: Recording availability event ...
de: Verfügbarkeitsereignis wird aufgezeichnet ...
es: Registrando evento de disponibilidad ...
zh: 正在记录可用性事件...

# equipAvailDone
source: Availability event recorded.
de: Verfügbarkeitsereignis aufgezeichnet.
es: Evento de disponibilidad registrado.
zh: 可用性事件已记录。

# equipProdStart
source: Recording production event ...
de: Produktionsereignis wird aufgezeichnet ...
es: Registrando evento de producción ...
zh: 正在记录生产事件...

# equipProdDone
source: Production event recorded.
de: Produktionsereignis aufgezeichnet.
es: Evento de producción registrado.
zh: 生产事件已记录。

# equipSetupStart
source: Recording set up event ...
de: Rüstereignis wird aufgezeichnet ...
es: Registrando evento de configuración ...
zh: 正在记录设置事件...

# equipSetupDone
source: Set up event recorded.
de: Rüstereignis aufgezeichnet.
es: Evento de configuración registrado.
zh: 设置事件已记录。

# equipTabAvail
source: Availability
de: Verfügbarkeit
es: Disponibilidad
zh: 可用性

# equipTabProd
source: Production
de: Produktion
es: Producción
zh: 生产

# equipTabSetup
source: Setup/Job
de: Rüsten/Auftrag
es: Configuración/Trabajo
zh: 设置/作业

# equipNoReason
source: Choose reason
de: Grund wählen
es: Elegir razón
zh: 选择原因

# equipNoMaterial
source: Choose material
de: Material wählen
es: Elegir material
zh: 选择材料

# equipReason
source: Reason
de: Grund
es: Razón
zh: 原因

# equipMaterial
source: Material
zh: 材料

# equipTimePeriod
source: By Time Period
de: Nach Zeitraum
es: Por Período de Tiempo
zh: 按时间段

# equipEvent
source: By Event
de: Nach Ereignis
es: Por Evento
zh: 按事件

# equipStart
source: Start Time
de: Startzeit
es: Hora de Inicio
zh: 开始时间

# equipEnd
source: End Time
de: Endzeit
es: Hora de Finalización
zh: 结束时间

# equipDuration
source: Duration
de: Dauer
es: Duración
zh: 持续时间

# equipHrs
source: Hours
de: Stunden
es: Horas
zh: 小时

# equipMins
source: Minutes
de: Minuten
es: Minutos
zh: 分钟

# equipSubmit
source: Submit
de: Senden
es: Enviar
zh: 提交

# equipGood
source: Good
de: Gut
es: Bueno
zh: 良品

# equipReject
source: Reject/Rework
de: Ausschuss/Nacharbeit
es: Rechazar/Retrabajar
zh: 废品/返工

# equipStartup
source: Startup
de: Anlauf
es: Arranque
zh: 启动

# equipAmountHint
source: Enter amount
de: Menge eingeben
es: Ingrese cantidad
zh: 输入数量

# equipAmountLabel
source: Amount *
de: Menge *
es: Cantidad *
zh: 数量 *

# equipJobHint
source: Job Id
de: Auftrags-ID
es: ID del Trabajo
zh: 作业 ID

# equipJobLabel
source: Job
de: Auftrag
es: Trabajo
zh: 作业

# equipMaterialLabel
source: Material
zh: 材料

# equipMatlDescLabel
source: Description
de: Beschreibung
es: Descripción
zh: 描述

# equipReasonLabel
source: Current Reason
de: Aktueller Grund
es: Razón Actual
zh: 当前原因

# equipLossLabel
source: Loss Category
de: Verlustkategorie
es: Categoría de Pérdida
zh: 损失类别

# equipRunLabel
source: Run Rate UOM
de: Laufrate Einheit
es: UOM Tasa de Funcionamiento
zh: 运行速率单位

# equipRejectLabel
source: Reject UOM
de: Ausschuss Einheit
es: UOM Rechazo
zh: 废品单位

# equipStatus
source: Equipment Status
de: Anlagenstatus
es: Estado del Equipo
zh: 设备状态

# buttonClose
source: Close
de: Schließen
es: Cerrar
zh: 关闭

# errorTitle
source: OEE Application Error
de: OEE Anwendungsfehler
es: Error de Aplicación OEE
zh: OEE 应用程序错误

# infoTitle
source: OEE Application Information
de: OEE Anwendungsinformation
es: Información de Aplicación OEE
zh: OEE 应用程序信息

# reasonTitle
source: OEE Reasons
de: OEE Gründe
es: Razones OEE
zh: OEE 原因

# materialTitle
source: OEE Materials
de: OEE Materialien
es: Materiales OEE
zh: OEE 材料

source: Refreshed entities
de: Entitäten aktualisiert
es: Entidades actualizadas
zh: 已刷新实体

source: Refreshed materials
de: Materialien aktualisiert
es: Materiales actualizados
zh: 已刷新材料

source: Refreshed reasons
de: Gründe aktualisiert
es: Razones actualizadas
zh: 已刷新原因

source: Retry
de: Wiederholen
es: Reintentar
zh: 重试

source: Loading ...
de: Wird geladen ...
es: Cargando ...
zh: 加载中...

source: None
de: Keine
es: Ninguno
zh: 无

source: N/A
de: N/V
zh: 不适用

# lossMinorStoppages
source: Minor Stoppage
de: Kleinere Stillstände
es: Parada Menor
zh: 小停机

# lossNoLoss
source: Running Normally
de: Läuft normal
es: Funcionando Normalmente
zh: 正常运行

# lossNotScheduled
source: Not Currently Scheduled
de: Derzeit nicht geplant
es: No Programado Actualmente
zh: 当前未安排

# lossPlannedDowntime
source: Planned Downtime
de: Geplante Stillstandszeit
es: Tiempo de Inactividad Planificado
zh: 计划停机

# lossReducedSpeed
source: Running at Reduced Speed
de: Läuft mit reduzierter Geschwindigkeit
es: Funcionando a Velocidad Reducida
zh: 降速运行

# lossRejectRework
source: Rejected Material
de: Ausschussmaterial
es: Material Rechazado
zh: 废品材料

# lossSetup
source: Machine Setup
de: Maschinenrüstung
es: Configuración de Máquina
zh: 机器设置

# lossStartupYield
source: Machine Startup Yield
de: Maschinenanlauf-Ausbeute
es: Rendimiento de Arranque de Máquina
zh: 机器启动产出

# lossUnplannedDowntime
source: Unplanned Downtime
de: Ungeplante Stillstandszeit
es: Tiempo de Inactividad No Planificado
zh: 非计划停机

# lossUnscheduled
source: Unscheduled
de: Ungeplant
es: No Programado
zh: 未安排

# errNoHttpServer
source: The HTTP server name and port must be defined under Settings.
de: Der HTTP-Servername und Port müssen in den Einstellungen definiert werden.
es: El nombre del servidor HTTP y el puerto deben definirse en Configuraciones.
zh: 必须在设置中定义 HTTP 服务器名称和端口。

# errNoServerName
source: Server name is required.
de: Servername ist erforderlich.
es: El nombre del servidor es requerido.
zh: 需要服务器名称。

# errNoServerPort
source: Server port is required.
de: Server-Port ist erforderlich.
es: El puerto del servidor es requerido.
zh: 需要服务器端口。

# errInvalidDate
source: The date {date} is not valid.
de: Das Datum {date} ist nicht gültig.
es: La fecha {date} no es válida.
zh: 日期 {date} 无效。

# errMaterialTimeOut
source: Fetching materials timed out.
de: Zeitüberschreitung beim Abrufen der Materialien.
es: La obtención de materiales ha expirado.
zh: 获取材料超时。

# errMustSelectEvent
source: The production event type must be selected.
de: Der Produktionsereignistyp muss ausgewählt werden.
es: El tipo de evento de producción debe ser seleccionado.
zh: 必须选择生产事件类型。

# errNoSetup
source: No setup has been performed for equipment {name}.
de: Für Anlage {name} wurde keine Rüstung durchgeführt.
es: No se ha realizado configuración para el equipo {name}.
zh: 设备 {name} 尚未执行设置。

# errInvalidAmount
source: The amount {amount} must be greater than zero.
de: Die Menge {amount} muss größer als null sein.
es: La cantidad {amount} debe ser mayor que cero.
zh: 数量 {amount} 必须大于零。

# errInvalidDuration
source: The duration {duration} must be greater than zero.
de: Die Dauer {duration} muss größer als null sein.
es: La duración {duration} debe ser mayor que cero.
zh: 持续时间 {duration} 必须大于零。

# errLoadFailed
source: Failed to load equipment {name}: {message}.
de: Fehler beim Laden der Anlage {name}: {message}.
es: Error al cargar equipo {name}: {message}.
zh: 加载设备 {name} 失败：{message}。

# errGetFailed
source: Failed to get equipment {name}: {message}.
de: Fehler beim Abrufen der Anlage {name}: {message}.
es: Error al obtener equipo {name}: {message}.
zh: 获取设备 {name} 失败：{message}。

# errStatusGetFailed
source: Failed to get status for equipment {name}: {message}.
de: Fehler beim Abrufen des Status für Anlage {name}: {message}.
es: Error al obtener estado del equipo {name}: {message}.
zh: 获取设备 {name} 状态失败：{message}。

# errNoEquipmentName
source: Equipment name cannot be empty.
de: Anlagenname darf nicht leer sein.
es: El nombre del equipo no puede estar vacío.
zh: 设备名称不能为空。

# errNoEntities
source: No entities found.
de: Keine Entitäten gefunden.
es: No se encontraron entidades.
zh: 未找到实体。

# errConnection
source: Pull to refresh or check your connection.
de: Zum Aktualisieren ziehen oder Verbindung prüfen.
es: Desliza para actualizar o verifica tu conexión.
zh: 下拉刷新或检查网络连接。

# errFailedLoadingEntities
source: Error loading entities
de: Fehler beim Laden der Entitäten
es: Error cargando entidades
zh: 加载实体时出错

# errFailedLoadingMaterials
source: Error loading materials
de: Fehler beim Laden der Materialien
es: Error cargando materiales
zh: 加载材料时出错

# errFailedLoadingReasons
source: Error loading reasons
de: Fehler beim Laden der Gründe
es: Error cargando razones
zh: 加载原因时出错

# errFailedLoadingSettings
source: Error loading settings {message}
de: Fehler beim Laden der Einstellungen {message}
es: Error cargando configuraciones {message}
zh: 加载设置时出错 {message}
